STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255fxx_ca35.h
/*****************  Bit definition for LVDS_CDL1CR register  ******************/
#define LVDS_CDL1CR_DISTR0_Pos                                 (0U)
#define LVDS_CDL1CR_DISTR0_Msk                                 (0xFUL << LVDS_CDL1CR_DISTR0_Pos)                                 /*!< 0x0000000F */
#define LVDS_CDL1CR_DISTR0                                     LVDS_CDL1CR_DISTR0_Msk                                           /*!< channel distribution for Lane 0 */
#define LVDS_CDL1CR_DISTR0_0                                   (0x1UL << LVDS_CDL1CR_DISTR0_Pos)                                 /*!< 0x00000001 */
#define LVDS_CDL1CR_DISTR0_1                                   (0x2UL << LVDS_CDL1CR_DISTR0_Pos)                                 /*!< 0x00000002 */
#define LVDS_CDL1CR_DISTR0_2                                   (0x4UL << LVDS_CDL1CR_DISTR0_Pos)                                 /*!< 0x00000004 */
#define LVDS_CDL1CR_DISTR0_3                                   (0x8UL << LVDS_CDL1CR_DISTR0_Pos)                                 /*!< 0x00000008 */
#define LVDS_CDL1CR_DISTR1_Pos                                 (4U)
#define LVDS_CDL1CR_DISTR1_Msk                                 (0xFUL << LVDS_CDL1CR_DISTR1_Pos)                                 /*!< 0x000000F0 */
#define LVDS_CDL1CR_DISTR1                                     LVDS_CDL1CR_DISTR1_Msk                                           /*!< channel distribution for Lane 1 */
#define LVDS_CDL1CR_DISTR1_0                                   (0x1UL << LVDS_CDL1CR_DISTR1_Pos)                                /*!< 0x00000010 */
#define LVDS_CDL1CR_DISTR1_1                                   (0x2UL << LVDS_CDL1CR_DISTR1_Pos)                                /*!< 0x00000020 */
#define LVDS_CDL1CR_DISTR1_2                                   (0x4UL << LVDS_CDL1CR_DISTR1_Pos)                                /*!< 0x00000040 */
#define LVDS_CDL1CR_DISTR1_3                                   (0x8UL << LVDS_CDL1CR_DISTR1_Pos)                                /*!< 0x00000080 */
#define LVDS_CDL1CR_DISTR2_Pos                                 (8U)
#define LVDS_CDL1CR_DISTR2_Msk                                 (0xFUL << LVDS_CDL1CR_DISTR2_Pos)                                 /*!< 0x00000F00 */
#define LVDS_CDL1CR_DISTR2                                     LVDS_CDL1CR_DISTR2_Msk                                           /*!< channel distribution for Lane 2 */
#define LVDS_CDL1CR_DISTR2_0                                   (0x1UL << LVDS_CDL1CR_DISTR2_Pos)                               /*!< 0x00000100 */
#define LVDS_CDL1CR_DISTR2_1                                   (0x2UL << LVDS_CDL1CR_DISTR2_Pos)                               /*!< 0x00000200 */
#define LVDS_CDL1CR_DISTR2_2                                   (0x4UL << LVDS_CDL1CR_DISTR2_Pos)                               /*!< 0x00000400 */
#define LVDS_CDL1CR_DISTR2_3                                   (0x8UL << LVDS_CDL1CR_DISTR2_Pos)                               /*!< 0x00000800 */
#define LVDS_CDL1CR_DISTR3_Pos                                 (12U)
#define LVDS_CDL1CR_DISTR3_Msk                                 (0xFUL << LVDS_CDL1CR_DISTR3_Pos)                                 /*!< 0x0000F000 */
#define LVDS_CDL1CR_DISTR3                                     LVDS_CDL1CR_DISTR3_Msk                                           /*!< channel distribution for Lane 3 */
#define LVDS_CDL1CR_DISTR3_0                                   (0x1UL << LVDS_CDL1CR_DISTR3_Pos)                              /*!< 0x00001000 */
#define LVDS_CDL1CR_DISTR3_1                                   (0x2UL << LVDS_CDL1CR_DISTR3_Pos)                              /*!< 0x00002000 */
#define LVDS_CDL1CR_DISTR3_2                                   (0x4UL << LVDS_CDL1CR_DISTR3_Pos)                              /*!< 0x00004000 */
#define LVDS_CDL1CR_DISTR3_3                                   (0x8UL << LVDS_CDL1CR_DISTR3_Pos)                              /*!< 0x00008000 */
#define LVDS_CDL1CR_DISTR4_Pos                                 (16U)
#define LVDS_CDL1CR_DISTR4_Msk                                 (0xFUL << LVDS_CDL1CR_DISTR4_Pos)                                 /*!< 0x000F0000 */
#define LVDS_CDL1CR_DISTR4                                     LVDS_CDL1CR_DISTR4_Msk                                           /*!< channel distribution for Lane 4 */
#define LVDS_CDL1CR_DISTR4_0                                   (0x1UL << LVDS_CDL1CR_DISTR4_Pos)                             /*!< 0x00010000 */
#define LVDS_CDL1CR_DISTR4_1                                   (0x2UL << LVDS_CDL1CR_DISTR4_Pos)                             /*!< 0x00020000 */
#define LVDS_CDL1CR_DISTR4_2                                   (0x4UL << LVDS_CDL1CR_DISTR4_Pos)                             /*!< 0x00040000 */
#define LVDS_CDL1CR_DISTR4_3                                   (0x8UL << LVDS_CDL1CR_DISTR4_Pos)                             /*!< 0x00080000 */

/*****************  Bit definition for LVDS_CDL2CR register  ******************/
#define LVDS_CDL2CR_DISTR0_Pos                                 (0U)
#define LVDS_CDL2CR_DISTR0_Msk                                 (0xFUL << LVDS_CDL2CR_DISTR0_Pos)                                 /*!< 0x0000000F */
#define LVDS_CDL2CR_DISTR0                                     LVDS_CDL2CR_DISTR0_Msk                                           /*!< channel distribution for Lane 0 */
#define LVDS_CDL2CR_DISTR0_0                                   (0x1UL << LVDS_CDL2CR_DISTR0_Pos)                                 /*!< 0x00000001 */
#define LVDS_CDL2CR_DISTR0_1                                   (0x2UL << LVDS_CDL2CR_DISTR0_Pos)                                 /*!< 0x00000002 */
#define LVDS_CDL2CR_DISTR0_2                                   (0x4UL << LVDS_CDL2CR_DISTR0_Pos)                                 /*!< 0x00000004 */
#define LVDS_CDL2CR_DISTR0_3                                   (0x8UL << LVDS_CDL2CR_DISTR0_Pos)                                 /*!< 0x00000008 */
#define LVDS_CDL2CR_DISTR1_Pos                                 (4U)
#define LVDS_CDL2CR_DISTR1_Msk                                 (0xFUL << LVDS_CDL2CR_DISTR1_Pos)                                 /*!< 0x000000F0 */
#define LVDS_CDL2CR_DISTR1                                     LVDS_CDL2CR_DISTR1_Msk                                           /*!< channel distribution for Lane 1 */
#define LVDS_CDL2CR_DISTR1_0                                   (0x1UL << LVDS_CDL2CR_DISTR1_Pos)                                /*!< 0x00000010 */
#define LVDS_CDL2CR_DISTR1_1                                   (0x2UL << LVDS_CDL2CR_DISTR1_Pos)                                /*!< 0x00000020 */
#define LVDS_CDL2CR_DISTR1_2                                   (0x4UL << LVDS_CDL2CR_DISTR1_Pos)                                /*!< 0x00000040 */
#define LVDS_CDL2CR_DISTR1_3                                   (0x8UL << LVDS_CDL2CR_DISTR1_Pos)                                /*!< 0x00000080 */
#define LVDS_CDL2CR_DISTR2_Pos                                 (8U)
#define LVDS_CDL2CR_DISTR2_Msk                                 (0xFUL << LVDS_CDL2CR_DISTR2_Pos)                                 /*!< 0x00000F00 */
#define LVDS_CDL2CR_DISTR2                                     LVDS_CDL2CR_DISTR2_Msk                                           /*!< channel distribution for Lane 2 */
#define LVDS_CDL2CR_DISTR2_0                                   (0x1UL << LVDS_CDL2CR_DISTR2_Pos)                               /*!< 0x00000100 */
#define LVDS_CDL2CR_DISTR2_1                                   (0x2UL << LVDS_CDL2CR_DISTR2_Pos)                               /*!< 0x00000200 */
#define LVDS_CDL2CR_DISTR2_2                                   (0x4UL << LVDS_CDL2CR_DISTR2_Pos)                               /*!< 0x00000400 */
#define LVDS_CDL2CR_DISTR2_3                                   (0x8UL << LVDS_CDL2CR_DISTR2_Pos)                               /*!< 0x00000800 */
#define LVDS_CDL2CR_DISTR3_Pos                                 (12U)
#define LVDS_CDL2CR_DISTR3_Msk                                 (0xFUL << LVDS_CDL2CR_DISTR3_Pos)                                 /*!< 0x0000F000 */
#define LVDS_CDL2CR_DISTR3                                     LVDS_CDL2CR_DISTR3_Msk                                           /*!< channel distribution for Lane 3 */
#define LVDS_CDL2CR_DISTR3_0                                   (0x1UL << LVDS_CDL2CR_DISTR3_Pos)                              /*!< 0x00001000 */
#define LVDS_CDL2CR_DISTR3_1                                   (0x2UL << LVDS_CDL2CR_DISTR3_Pos)                              /*!< 0x00002000 */
#define LVDS_CDL2CR_DISTR3_2                                   (0x4UL << LVDS_CDL2CR_DISTR3_Pos)                              /*!< 0x00004000 */
#define LVDS_CDL2CR_DISTR3_3                                   (0x8UL << LVDS_CDL2CR_DISTR3_Pos)                              /*!< 0x00008000 */
#define LVDS_CDL2CR_DISTR4_Pos                                 (16U)
#define LVDS_CDL2CR_DISTR4_Msk                                 (0xFUL << LVDS_CDL2CR_DISTR4_Pos)                                 /*!< 0x000F0000 */
#define LVDS_CDL2CR_DISTR4                                     LVDS_CDL2CR_DISTR4_Msk                                           /*!< channel distribution for Lane 4 */
#define LVDS_CDL2CR_DISTR4_0                                   (0x1UL << LVDS_CDL2CR_DISTR4_Pos)                             /*!< 0x00010000 */
#define LVDS_CDL2CR_DISTR4_1                                   (0x2UL << LVDS_CDL2CR_DISTR4_Pos)                             /*!< 0x00020000 */
#define LVDS_CDL2CR_DISTR4_2                                   (0x4UL << LVDS_CDL2CR_DISTR4_Pos)                             /*!< 0x00040000 */
#define LVDS_CDL2CR_DISTR4_3                                   (0x8UL << LVDS_CDL2CR_DISTR4_Pos)                             /*!< 0x00080000 */
#define LVDS_CDL2CR_PRBS_Pos                                   (24U)
#define LVDS_CDL2CR_PRBS_Msk                                   (0x3UL << LVDS_CDL2CR_PRBS_Pos)                                   /*!< 0x03000000 */
#define LVDS_CDL2CR_PRBS                                       LVDS_CDL2CR_PRBS_Msk                                             /*!< PRBS polynome type */
#define LVDS_CDL2CR_PRBS_0                                     (0x1UL << LVDS_CDL2CR_PRBS_Pos)                             /*!< 0x01000000 */
#define LVDS_CDL2CR_PRBS_1                                     (0x2UL << LVDS_CDL2CR_PRBS_Pos)                             /*!< 0x02000000 */

/******************  Bit definition for LVDS_PMGCR register  ******************/
#define LVDS_PMGCR_MST_BIT_CLK_OUT_ENABLE_Pos                  (0U)
#define LVDS_PMGCR_MST_BIT_CLK_OUT_ENABLE_Msk                  (0x1UL << LVDS_PMGCR_MST_BIT_CLK_OUT_ENABLE_Pos)                  /*!< 0x00000001 */
#define LVDS_PMGCR_MST_BIT_CLK_OUT_ENABLE                      LVDS_PMGCR_MST_BIT_CLK_OUT_ENABLE_Msk                            /*!< Enable LVDS-PHY bit_clk clock */
#define LVDS_PMGCR_MST_LS_CLK_OUT_ENABLE_Pos                   (4U)
#define LVDS_PMGCR_MST_LS_CLK_OUT_ENABLE_Msk                   (0x1UL << LVDS_PMGCR_MST_LS_CLK_OUT_ENABLE_Pos)                   /*!< 0x00000010 */
#define LVDS_PMGCR_MST_LS_CLK_OUT_ENABLE                       LVDS_PMGCR_MST_LS_CLK_OUT_ENABLE_Msk                             /*!< Enable LVDS-PHY ls_clk clock */
#define LVDS_PMGCR_MST_DP_CLK_OUT_ENABLE_Pos                   (8U)
#define LVDS_PMGCR_MST_DP_CLK_OUT_ENABLE_Msk                   (0x1UL << LVDS_PMGCR_MST_DP_CLK_OUT_ENABLE_Pos)                   /*!< 0x00000100 */
#define LVDS_PMGCR_MST_DP_CLK_OUT_ENABLE                       LVDS_PMGCR_MST_DP_CLK_OUT_ENABLE_Msk                             /*!< Enable LVDS-PHY dp_clk clock */
#define LVDS_PMGCR_MST_RSTZ_Pos                                (24U)
#define LVDS_PMGCR_MST_RSTZ_Msk                                (0x1UL << LVDS_PMGCR_MST_RSTZ_Pos)                                /*!< 0x01000000 */
#define LVDS_PMGCR_MST_RSTZ                                    LVDS_PMGCR_MST_RSTZ_Msk                                          /*!< When set to 0, this bit places the digital section of the LVDS-PHY in the reset state */
#define LVDS_PMGCR_MST_DIVIDERS_RSTN_Pos                       (25U)
#define LVDS_PMGCR_MST_DIVIDERS_RSTN_Msk                       (0x1UL << LVDS_PMGCR_MST_DIVIDERS_RSTN_Pos)                       /*!< 0x02000000 */
#define LVDS_PMGCR_MST_DIVIDERS_RSTN                           LVDS_PMGCR_MST_DIVIDERS_RSTN_Msk                                 /*!< Resets the Output Dividers: */

/*****************  Bit definition for LVDS_PMPEACR register  *****************/
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL0_Pos                  (0U)
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL0_Msk                  (0xFUL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL0_Pos)                  /*!< 0x0000000F */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL0                      LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL0_Msk                            /*!< Amplitude control for pre-emphasis for lane0 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL0_0                    (0x1UL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL0_Pos)                  /*!< 0x00000001 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL0_1                    (0x2UL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL0_Pos)                  /*!< 0x00000002 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL0_2                    (0x4UL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL0_Pos)                  /*!< 0x00000004 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL0_3                    (0x8UL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL0_Pos)                  /*!< 0x00000008 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL1_Pos                  (4U)
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL1_Msk                  (0xFUL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL1_Pos)                  /*!< 0x000000F0 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL1                      LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL1_Msk                            /*!< Amplitude control for pre-emphasis for lane1 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL1_0                    (0x1UL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL1_Pos)                 /*!< 0x00000010 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL1_1                    (0x2UL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL1_Pos)                 /*!< 0x00000020 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL1_2                    (0x4UL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL1_Pos)                 /*!< 0x00000040 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL1_3                    (0x8UL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL1_Pos)                 /*!< 0x00000080 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL2_Pos                  (8U)
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL2_Msk                  (0xFUL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL2_Pos)                  /*!< 0x00000F00 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL2                      LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL2_Msk                            /*!< Amplitude control for pre-emphasis for lane2 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL2_0                    (0x1UL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL2_Pos)                /*!< 0x00000100 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL2_1                    (0x2UL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL2_Pos)                /*!< 0x00000200 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL2_2                    (0x4UL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL2_Pos)                /*!< 0x00000400 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL2_3                    (0x8UL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL2_Pos)                /*!< 0x00000800 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL3_Pos                  (12U)
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL3_Msk                  (0xFUL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL3_Pos)                  /*!< 0x0000F000 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL3                      LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL3_Msk                            /*!< Amplitude control for pre-emphasis for lane3 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL3_0                    (0x1UL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL3_Pos)               /*!< 0x00001000 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL3_1                    (0x2UL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL3_Pos)               /*!< 0x00002000 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL3_2                    (0x4UL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL3_Pos)               /*!< 0x00004000 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL3_3                    (0x8UL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL3_Pos)               /*!< 0x00008000 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL4_Pos                  (16U)
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL4_Msk                  (0xFUL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL4_Pos)                  /*!< 0x000F0000 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL4                      LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL4_Msk                            /*!< Amplitude control for pre-emphasis for lane4 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL4_0                    (0x1UL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL4_Pos)              /*!< 0x00010000 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL4_1                    (0x2UL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL4_Pos)              /*!< 0x00020000 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL4_2                    (0x4UL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL4_Pos)              /*!< 0x00040000 */
#define LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL4_3                    (0x8UL << LVDS_PMPEACR_MST_PRE_EMPH_AMP_DL4_Pos)              /*!< 0x00080000 */

/*****************  Bit definition for LVDS_PMPETCR register  *****************/
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL0_Pos                 (0U)
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL0_Msk                 (0x3UL << LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL0_Pos)                 /*!< 0x00000003 */
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL0                     LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL0_Msk                           /*!< Time duration control for pre-emphasis for lane0 */
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL0_0                   (0x1UL << LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL0_Pos)                 /*!< 0x00000001 */
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL0_1                   (0x2UL << LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL0_Pos)                 /*!< 0x00000002 */
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL1_Pos                 (4U)
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL1_Msk                 (0x3UL << LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL1_Pos)                 /*!< 0x00000030 */
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL1                     LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL1_Msk                           /*!< Time duration control for pre-emphasis for lane1 */
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL1_0                   (0x1UL << LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL1_Pos)                /*!< 0x00000010 */
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL1_1                   (0x2UL << LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL1_Pos)                /*!< 0x00000020 */
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL2_Pos                 (8U)
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL2_Msk                 (0x3UL << LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL2_Pos)                 /*!< 0x00000300 */
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL2                     LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL2_Msk                           /*!< Time duration control for pre-emphasis for lane2 */
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL2_0                   (0x1UL << LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL2_Pos)               /*!< 0x00000100 */
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL2_1                   (0x2UL << LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL2_Pos)               /*!< 0x00000200 */
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL3_Pos                 (12U)
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL3_Msk                 (0x3UL << LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL3_Pos)                 /*!< 0x00003000 */
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL3                     LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL3_Msk                           /*!< Time duration control for pre-emphasis for lane3 */
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL3_0                   (0x1UL << LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL3_Pos)              /*!< 0x00001000 */
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL3_1                   (0x2UL << LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL3_Pos)              /*!< 0x00002000 */
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL4_Pos                 (16U)
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL4_Msk                 (0x3UL << LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL4_Pos)                 /*!< 0x00030000 */
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL4                     LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL4_Msk                           /*!< Time duration control for pre-emphasis for lane4 */
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL4_0                   (0x1UL << LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL4_Pos)             /*!< 0x00010000 */
#define LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL4_1                   (0x2UL << LVDS_PMPETCR_MST_PRE_EMPH_TIME_DL4_Pos)             /*!< 0x00020000 */

