STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255fxx_ca35.h
/*****************  Bit definition for LVDS_PMCMCR1 register  *****************/
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL0_Pos                   (0U)
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL0_Msk                   (0xFUL << LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL0_Pos)                   /*!< 0x0000000F */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL0                       LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL0_Msk                             /*!< Amplitude control for current mode driver, data lane0 */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL0_0                     (0x1UL << LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL0_Pos)                   /*!< 0x00000001 */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL0_1                     (0x2UL << LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL0_Pos)                   /*!< 0x00000002 */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL0_2                     (0x4UL << LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL0_Pos)                   /*!< 0x00000004 */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL0_3                     (0x8UL << LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL0_Pos)                   /*!< 0x00000008 */
#define LVDS_PMCMCR1_MST_CM_EN_DL0_Pos                         (4U)
#define LVDS_PMCMCR1_MST_CM_EN_DL0_Msk                         (0x1UL << LVDS_PMCMCR1_MST_CM_EN_DL0_Pos)                         /*!< 0x00000010 */
#define LVDS_PMCMCR1_MST_CM_EN_DL0                             LVDS_PMCMCR1_MST_CM_EN_DL0_Msk                                   /*!< Enable for current mode driver, data lane0 */
#define LVDS_PMCMCR1_MST_CM_USE_VDD_REF_DL0_Pos                (5U)
#define LVDS_PMCMCR1_MST_CM_USE_VDD_REF_DL0_Msk                (0x1UL << LVDS_PMCMCR1_MST_CM_USE_VDD_REF_DL0_Pos)                /*!< 0x00000020 */
#define LVDS_PMCMCR1_MST_CM_USE_VDD_REF_DL0                    LVDS_PMCMCR1_MST_CM_USE_VDD_REF_DL0_Msk                          /*!< common mode of datalane0: when high, reference is derived from AVDD_IO voltage */
#define LVDS_PMCMCR1_MST_CM_USE_VM_VMID_DL0_Pos                (6U)
#define LVDS_PMCMCR1_MST_CM_USE_VM_VMID_DL0_Msk                (0x1UL << LVDS_PMCMCR1_MST_CM_USE_VM_VMID_DL0_Pos)                /*!< 0x00000040 */
#define LVDS_PMCMCR1_MST_CM_USE_VM_VMID_DL0                    LVDS_PMCMCR1_MST_CM_USE_VM_VMID_DL0_Msk                          /*!< common mode of datalane0: when high, reference is mid voltage of the driver levels */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL1_Pos                   (8U)
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL1_Msk                   (0xFUL << LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL1_Pos)                   /*!< 0x00000F00 */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL1                       LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL1_Msk                             /*!< Amplitude control for current mode driver, data lane1 */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL1_0                     (0x1UL << LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL1_Pos)                 /*!< 0x00000100 */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL1_1                     (0x2UL << LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL1_Pos)                 /*!< 0x00000200 */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL1_2                     (0x4UL << LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL1_Pos)                 /*!< 0x00000400 */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL1_3                     (0x8UL << LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL1_Pos)                 /*!< 0x00000800 */
#define LVDS_PMCMCR1_MST_CM_EN_DL1_Pos                         (12U)
#define LVDS_PMCMCR1_MST_CM_EN_DL1_Msk                         (0x1UL << LVDS_PMCMCR1_MST_CM_EN_DL1_Pos)                         /*!< 0x00001000 */
#define LVDS_PMCMCR1_MST_CM_EN_DL1                             LVDS_PMCMCR1_MST_CM_EN_DL1_Msk                                   /*!< Enable for current mode driver, data lane1 */
#define LVDS_PMCMCR1_MST_CM_USE_VDD_REF_DL1_Pos                (13U)
#define LVDS_PMCMCR1_MST_CM_USE_VDD_REF_DL1_Msk                (0x1UL << LVDS_PMCMCR1_MST_CM_USE_VDD_REF_DL1_Pos)                /*!< 0x00002000 */
#define LVDS_PMCMCR1_MST_CM_USE_VDD_REF_DL1                    LVDS_PMCMCR1_MST_CM_USE_VDD_REF_DL1_Msk                          /*!< common mode of datalane1: when high, reference is derived from AVDD_IO voltage */
#define LVDS_PMCMCR1_MST_CM_USE_VM_VMID_DL1_Pos                (14U)
#define LVDS_PMCMCR1_MST_CM_USE_VM_VMID_DL1_Msk                (0x1UL << LVDS_PMCMCR1_MST_CM_USE_VM_VMID_DL1_Pos)                /*!< 0x00004000 */
#define LVDS_PMCMCR1_MST_CM_USE_VM_VMID_DL1                    LVDS_PMCMCR1_MST_CM_USE_VM_VMID_DL1_Msk                          /*!< common mode of datalane1: when high, reference is mid voltage of the driver levels */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL2_Pos                   (16U)
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL2_Msk                   (0xFUL << LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL2_Pos)                   /*!< 0x000F0000 */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL2                       LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL2_Msk                             /*!< Amplitude control for current mode driver, data lane2 */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL2_0                     (0x1UL << LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL2_Pos)               /*!< 0x00010000 */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL2_1                     (0x2UL << LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL2_Pos)               /*!< 0x00020000 */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL2_2                     (0x4UL << LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL2_Pos)               /*!< 0x00040000 */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL2_3                     (0x8UL << LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL2_Pos)               /*!< 0x00080000 */
#define LVDS_PMCMCR1_MST_CM_EN_DL2_Pos                         (20U)
#define LVDS_PMCMCR1_MST_CM_EN_DL2_Msk                         (0x1UL << LVDS_PMCMCR1_MST_CM_EN_DL2_Pos)                         /*!< 0x00100000 */
#define LVDS_PMCMCR1_MST_CM_EN_DL2                             LVDS_PMCMCR1_MST_CM_EN_DL2_Msk                                   /*!< Enable for current mode driver, data lane2 */
#define LVDS_PMCMCR1_MST_CM_USE_VDD_REF_DL2_Pos                (21U)
#define LVDS_PMCMCR1_MST_CM_USE_VDD_REF_DL2_Msk                (0x1UL << LVDS_PMCMCR1_MST_CM_USE_VDD_REF_DL2_Pos)                /*!< 0x00200000 */
#define LVDS_PMCMCR1_MST_CM_USE_VDD_REF_DL2                    LVDS_PMCMCR1_MST_CM_USE_VDD_REF_DL2_Msk                          /*!< common mode of datalane2: when high, reference is derived from AVDD_IO voltage */
#define LVDS_PMCMCR1_MST_CM_USE_VM_VMID_DL2_Pos                (22U)
#define LVDS_PMCMCR1_MST_CM_USE_VM_VMID_DL2_Msk                (0x1UL << LVDS_PMCMCR1_MST_CM_USE_VM_VMID_DL2_Pos)                /*!< 0x00400000 */
#define LVDS_PMCMCR1_MST_CM_USE_VM_VMID_DL2                    LVDS_PMCMCR1_MST_CM_USE_VM_VMID_DL2_Msk                          /*!< common mode of datalane2: when high, reference is mid voltage of the driver levels */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL3_Pos                   (24U)
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL3_Msk                   (0xFUL << LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL3_Pos)                   /*!< 0x0F000000 */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL3                       LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL3_Msk                             /*!< Amplitude control for current mode driver, data lane3 */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL3_0                     (0x1UL << LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL3_Pos)             /*!< 0x01000000 */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL3_1                     (0x2UL << LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL3_Pos)             /*!< 0x02000000 */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL3_2                     (0x4UL << LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL3_Pos)             /*!< 0x04000000 */
#define LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL3_3                     (0x8UL << LVDS_PMCMCR1_MST_CM_AMP_CTRL_DL3_Pos)             /*!< 0x08000000 */
#define LVDS_PMCMCR1_MST_CM_EN_DL3_Pos                         (28U)
#define LVDS_PMCMCR1_MST_CM_EN_DL3_Msk                         (0x1UL << LVDS_PMCMCR1_MST_CM_EN_DL3_Pos)                         /*!< 0x10000000 */
#define LVDS_PMCMCR1_MST_CM_EN_DL3                             LVDS_PMCMCR1_MST_CM_EN_DL3_Msk                                   /*!< Enable for current mode driver, data lane3 */
#define LVDS_PMCMCR1_MST_CM_USE_VDD_REF_DL3_Pos                (29U)
#define LVDS_PMCMCR1_MST_CM_USE_VDD_REF_DL3_Msk                (0x1UL << LVDS_PMCMCR1_MST_CM_USE_VDD_REF_DL3_Pos)                /*!< 0x20000000 */
#define LVDS_PMCMCR1_MST_CM_USE_VDD_REF_DL3                    LVDS_PMCMCR1_MST_CM_USE_VDD_REF_DL3_Msk                          /*!< common mode of datalane3: when high, reference is derived from AVDD_IO voltage */
#define LVDS_PMCMCR1_MST_CM_USE_VM_VMID_DL3_Pos                (30U)
#define LVDS_PMCMCR1_MST_CM_USE_VM_VMID_DL3_Msk                (0x1UL << LVDS_PMCMCR1_MST_CM_USE_VM_VMID_DL3_Pos)                /*!< 0x40000000 */
#define LVDS_PMCMCR1_MST_CM_USE_VM_VMID_DL3                    LVDS_PMCMCR1_MST_CM_USE_VM_VMID_DL3_Msk                          /*!< common mode of datalane3: when high, reference is mid voltage of the driver levels */

/*****************  Bit definition for LVDS_PMCMCR2 register  *****************/
#define LVDS_PMCMCR2_MST_CM_AMP_CTRL_DL4_Pos                   (0U)
#define LVDS_PMCMCR2_MST_CM_AMP_CTRL_DL4_Msk                   (0xFUL << LVDS_PMCMCR2_MST_CM_AMP_CTRL_DL4_Pos)                   /*!< 0x0000000F */
#define LVDS_PMCMCR2_MST_CM_AMP_CTRL_DL4                       LVDS_PMCMCR2_MST_CM_AMP_CTRL_DL4_Msk                             /*!< Amplitude control for current mode driver, data lane4 */
#define LVDS_PMCMCR2_MST_CM_AMP_CTRL_DL4_0                     (0x1UL << LVDS_PMCMCR2_MST_CM_AMP_CTRL_DL4_Pos)                   /*!< 0x00000001 */
#define LVDS_PMCMCR2_MST_CM_AMP_CTRL_DL4_1                     (0x2UL << LVDS_PMCMCR2_MST_CM_AMP_CTRL_DL4_Pos)                   /*!< 0x00000002 */
#define LVDS_PMCMCR2_MST_CM_AMP_CTRL_DL4_2                     (0x4UL << LVDS_PMCMCR2_MST_CM_AMP_CTRL_DL4_Pos)                   /*!< 0x00000004 */
#define LVDS_PMCMCR2_MST_CM_AMP_CTRL_DL4_3                     (0x8UL << LVDS_PMCMCR2_MST_CM_AMP_CTRL_DL4_Pos)                   /*!< 0x00000008 */
#define LVDS_PMCMCR2_MST_CM_EN_DL4_Pos                         (4U)
#define LVDS_PMCMCR2_MST_CM_EN_DL4_Msk                         (0x1UL << LVDS_PMCMCR2_MST_CM_EN_DL4_Pos)                         /*!< 0x00000010 */
#define LVDS_PMCMCR2_MST_CM_EN_DL4                             LVDS_PMCMCR2_MST_CM_EN_DL4_Msk                                   /*!< Enable for current mode driver, data lane4 */
#define LVDS_PMCMCR2_MST_CM_USE_VDD_REF_DL4_Pos                (5U)
#define LVDS_PMCMCR2_MST_CM_USE_VDD_REF_DL4_Msk                (0x1UL << LVDS_PMCMCR2_MST_CM_USE_VDD_REF_DL4_Pos)                /*!< 0x00000020 */
#define LVDS_PMCMCR2_MST_CM_USE_VDD_REF_DL4                    LVDS_PMCMCR2_MST_CM_USE_VDD_REF_DL4_Msk                          /*!< common mode of datalane4: when high, reference is derived from AVDD_IO voltage */
#define LVDS_PMCMCR2_MST_CM_USE_VM_VMID_DL4_Pos                (6U)
#define LVDS_PMCMCR2_MST_CM_USE_VM_VMID_DL4_Msk                (0x1UL << LVDS_PMCMCR2_MST_CM_USE_VM_VMID_DL4_Pos)                /*!< 0x00000040 */
#define LVDS_PMCMCR2_MST_CM_USE_VM_VMID_DL4                    LVDS_PMCMCR2_MST_CM_USE_VM_VMID_DL4_Msk                          /*!< common mode of datalane4: when high, reference is mid voltage of the driver levels */
#define LVDS_PMCMCR2_MST_AC_COUPLING_MODE_Pos                  (16U)
#define LVDS_PMCMCR2_MST_AC_COUPLING_MODE_Msk                  (0x1UL << LVDS_PMCMCR2_MST_AC_COUPLING_MODE_Pos)                  /*!< 0x00010000 */
#define LVDS_PMCMCR2_MST_AC_COUPLING_MODE                      LVDS_PMCMCR2_MST_AC_COUPLING_MODE_Msk                            /*!< AC Coupling Mode. */

/*****************  Bit definition for LVDS_PMRLPCR register  *****************/
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL0_Pos              (0U)
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL0_Msk              (0xFUL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL0_Pos)              /*!< 0x0000000F */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL0                  LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL0_Msk                        /*!< Rx loop back configuration for datalane0 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL0_0                (0x1UL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL0_Pos)              /*!< 0x00000001 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL0_1                (0x2UL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL0_Pos)              /*!< 0x00000002 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL0_2                (0x4UL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL0_Pos)              /*!< 0x00000004 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL0_3                (0x8UL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL0_Pos)              /*!< 0x00000008 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL1_Pos              (4U)
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL1_Msk              (0xFUL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL1_Pos)              /*!< 0x000000F0 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL1                  LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL1_Msk                        /*!< Rx loop back configuration for datalane1 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL1_0                (0x1UL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL1_Pos)             /*!< 0x00000010 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL1_1                (0x2UL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL1_Pos)             /*!< 0x00000020 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL1_2                (0x4UL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL1_Pos)             /*!< 0x00000040 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL1_3                (0x8UL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL1_Pos)             /*!< 0x00000080 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL2_Pos              (8U)
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL2_Msk              (0xFUL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL2_Pos)              /*!< 0x00000F00 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL2                  LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL2_Msk                        /*!< Rx loop back configuration for datalane2 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL2_0                (0x1UL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL2_Pos)            /*!< 0x00000100 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL2_1                (0x2UL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL2_Pos)            /*!< 0x00000200 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL2_2                (0x4UL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL2_Pos)            /*!< 0x00000400 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL2_3                (0x8UL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL2_Pos)            /*!< 0x00000800 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL3_Pos              (12U)
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL3_Msk              (0xFUL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL3_Pos)              /*!< 0x0000F000 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL3                  LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL3_Msk                        /*!< Rx loop back configuration for datalane3 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL3_0                (0x1UL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL3_Pos)           /*!< 0x00001000 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL3_1                (0x2UL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL3_Pos)           /*!< 0x00002000 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL3_2                (0x4UL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL3_Pos)           /*!< 0x00004000 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL3_3                (0x8UL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL3_Pos)           /*!< 0x00008000 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL4_Pos              (16U)
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL4_Msk              (0xFUL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL4_Pos)              /*!< 0x000F0000 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL4                  LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL4_Msk                        /*!< Rx loop back configuration for datalane4 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL4_0                (0x1UL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL4_Pos)          /*!< 0x00010000 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL4_1                (0x2UL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL4_Pos)          /*!< 0x00020000 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL4_2                (0x4UL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL4_Pos)          /*!< 0x00040000 */
#define LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL4_3                (0x8UL << LVDS_PMRLPCR_MST_RX_LOOP_BACK_CFG_DL4_Pos)          /*!< 0x00080000 */
#define LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL0_Pos                  (24U)
#define LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL0_Msk                  (0x1UL << LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL0_Pos)                  /*!< 0x01000000 */
#define LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL0                      LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL0_Msk                            /*!< Enable the loop back RX used for continuous monitoring, data lane0 */
#define LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL1_Pos                  (25U)
#define LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL1_Msk                  (0x1UL << LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL1_Pos)                  /*!< 0x02000000 */
#define LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL1                      LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL1_Msk                            /*!< Enable the loop back RX used for continuous monitoring, data lane1 */
#define LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL2_Pos                  (26U)
#define LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL2_Msk                  (0x1UL << LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL2_Pos)                  /*!< 0x04000000 */
#define LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL2                      LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL2_Msk                            /*!< Enable the loop back RX used for continuous monitoring, data lane2 */
#define LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL3_Pos                  (27U)
#define LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL3_Msk                  (0x1UL << LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL3_Pos)                  /*!< 0x08000000 */
#define LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL3                      LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL3_Msk                            /*!< Enable the loop back RX used for continuous monitoring, data lane3 */
#define LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL4_Pos                  (28U)
#define LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL4_Msk                  (0x1UL << LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL4_Pos)                  /*!< 0x10000000 */
#define LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL4                      LVDS_PMRLPCR_MST_EN_LOOP_BACK_DL4_Msk                            /*!< Enable the loop back RX used for continuous monitoring, data lane4 */

/*****************  Bit definition for LVDS_PMRLPSR register  *****************/
#define LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL0_Pos                (0U)
#define LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL0_Msk                (0x1UL << LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL0_Pos)                /*!< 0x00000001 */
#define LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL0                    LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL0_Msk                          /*!< Rx loop back output for lane0 */
#define LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL1_Pos                (4U)
#define LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL1_Msk                (0x1UL << LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL1_Pos)                /*!< 0x00000010 */
#define LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL1                    LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL1_Msk                          /*!< Rx loop back output for lane1 */
#define LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL2_Pos                (8U)
#define LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL2_Msk                (0x1UL << LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL2_Pos)                /*!< 0x00000100 */
#define LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL2                    LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL2_Msk                          /*!< Rx loop back output for lane2 */
#define LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL3_Pos                (12U)
#define LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL3_Msk                (0x1UL << LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL3_Pos)                /*!< 0x00001000 */
#define LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL3                    LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL3_Msk                          /*!< Rx loop back output for lane3 */
#define LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL4_Pos                (16U)
#define LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL4_Msk                (0x1UL << LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL4_Pos)                /*!< 0x00010000 */
#define LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL4                    LVDS_PMRLPSR_MST_RX_LOOP_BACK_A_DL4_Msk                          /*!< Rx loop back output for lane4 */

