STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255fxx_ca35.h
/*****************  Bit definition for LVDS_PMCFGCR register  *****************/
#define LVDS_PMCFGCR_MST_EN_DIG_DL_Pos                         (0U)
#define LVDS_PMCFGCR_MST_EN_DIG_DL_Msk                         (0x1FUL << LVDS_PMCFGCR_MST_EN_DIG_DL_Pos)                        /*!< 0x0000001F */
#define LVDS_PMCFGCR_MST_EN_DIG_DL                             LVDS_PMCFGCR_MST_EN_DIG_DL_Msk                                   /*!< Enables Digital DataLanes DL4..DL0 */
#define LVDS_PMCFGCR_MST_EN_DIG_DL_0                           (0x1UL << LVDS_PMCFGCR_MST_EN_DIG_DL_Pos)                         /*!< 0x00000001 */
#define LVDS_PMCFGCR_MST_EN_DIG_DL_1                           (0x2UL << LVDS_PMCFGCR_MST_EN_DIG_DL_Pos)                         /*!< 0x00000002 */
#define LVDS_PMCFGCR_MST_EN_DIG_DL_2                           (0x4UL << LVDS_PMCFGCR_MST_EN_DIG_DL_Pos)                         /*!< 0x00000004 */
#define LVDS_PMCFGCR_MST_EN_DIG_DL_3                           (0x8UL << LVDS_PMCFGCR_MST_EN_DIG_DL_Pos)                         /*!< 0x00000008 */
#define LVDS_PMCFGCR_MST_EN_DIG_DL_4                           (0x10UL << LVDS_PMCFGCR_MST_EN_DIG_DL_Pos)                        /*!< 0x00000010 */

/****************  Bit definition for LVDS_PMPLLCR1 register  *****************/
#define LVDS_PMPLLCR1_MST_PLL_ENABLE_Pos                       (0U)
#define LVDS_PMPLLCR1_MST_PLL_ENABLE_Msk                       (0x1UL << LVDS_PMPLLCR1_MST_PLL_ENABLE_Pos)                       /*!< 0x00000001 */
#define LVDS_PMPLLCR1_MST_PLL_ENABLE                           LVDS_PMPLLCR1_MST_PLL_ENABLE_Msk                                 /*!< 0x0: LVDS-PHY PLL Disable */
#define LVDS_PMPLLCR1_MST_PLL_SD_ENABLE_Pos                    (1U)
#define LVDS_PMPLLCR1_MST_PLL_SD_ENABLE_Msk                    (0x1UL << LVDS_PMPLLCR1_MST_PLL_SD_ENABLE_Pos)                    /*!< 0x00000002 */
#define LVDS_PMPLLCR1_MST_PLL_SD_ENABLE                        LVDS_PMPLLCR1_MST_PLL_SD_ENABLE_Msk                              /*!< sigma-delta enable */
#define LVDS_PMPLLCR1_MST_PLL_TWG_ENABLE_Pos                   (2U)
#define LVDS_PMPLLCR1_MST_PLL_TWG_ENABLE_Msk                   (0x1UL << LVDS_PMPLLCR1_MST_PLL_TWG_ENABLE_Pos)                   /*!< 0x00000004 */
#define LVDS_PMPLLCR1_MST_PLL_TWG_ENABLE                       LVDS_PMPLLCR1_MST_PLL_TWG_ENABLE_Msk                             /*!< Triangular wave pattern used to modulate MDIV */
#define LVDS_PMPLLCR1_MST_PLL_BYPASS_Pos                       (4U)
#define LVDS_PMPLLCR1_MST_PLL_BYPASS_Msk                       (0x1UL << LVDS_PMPLLCR1_MST_PLL_BYPASS_Pos)                       /*!< 0x00000010 */
#define LVDS_PMPLLCR1_MST_PLL_BYPASS                           LVDS_PMPLLCR1_MST_PLL_BYPASS_Msk                                 /*!< 0x0: from VCO output */
#define LVDS_PMPLLCR1_MST_PLL_DIVIDERS_ENABLE_Pos              (8U)
#define LVDS_PMPLLCR1_MST_PLL_DIVIDERS_ENABLE_Msk              (0x1UL << LVDS_PMPLLCR1_MST_PLL_DIVIDERS_ENABLE_Pos)              /*!< 0x00000100 */
#define LVDS_PMPLLCR1_MST_PLL_DIVIDERS_ENABLE                  LVDS_PMPLLCR1_MST_PLL_DIVIDERS_ENABLE_Msk                        /*!< 0x0: Dividers disabled */
#define LVDS_PMPLLCR1_MST_PLL_BYPASS_START_DECT_Pos            (12U)
#define LVDS_PMPLLCR1_MST_PLL_BYPASS_START_DECT_Msk            (0x1UL << LVDS_PMPLLCR1_MST_PLL_BYPASS_START_DECT_Pos)            /*!< 0x00001000 */
#define LVDS_PMPLLCR1_MST_PLL_BYPASS_START_DECT                LVDS_PMPLLCR1_MST_PLL_BYPASS_START_DECT_Msk                      /*!< Bypass start DECT. */
#define LVDS_PMPLLCR1_MST_LVDS_PLL_USE_BIT_CLK_IN_SYNC_Pos     (16U)
#define LVDS_PMPLLCR1_MST_LVDS_PLL_USE_BIT_CLK_IN_SYNC_Msk     (0x1UL << LVDS_PMPLLCR1_MST_LVDS_PLL_USE_BIT_CLK_IN_SYNC_Pos)     /*!< 0x00010000 */
#define LVDS_PMPLLCR1_MST_LVDS_PLL_USE_BIT_CLK_IN_SYNC         LVDS_PMPLLCR1_MST_LVDS_PLL_USE_BIT_CLK_IN_SYNC_Msk               /*!< Bypass control for the bit clock. */
#define LVDS_PMPLLCR1_MST_LVDS_PLL_USE_LS_CLK_IN_SYNC_Pos      (24U)
#define LVDS_PMPLLCR1_MST_LVDS_PLL_USE_LS_CLK_IN_SYNC_Msk      (0x1UL << LVDS_PMPLLCR1_MST_LVDS_PLL_USE_LS_CLK_IN_SYNC_Pos)      /*!< 0x01000000 */
#define LVDS_PMPLLCR1_MST_LVDS_PLL_USE_LS_CLK_IN_SYNC          LVDS_PMPLLCR1_MST_LVDS_PLL_USE_LS_CLK_IN_SYNC_Msk                /*!< Bypass control for the ls clock. */

/****************  Bit definition for LVDS_PMPLLCR2 register  *****************/
#define LVDS_PMPLLCR2_MST_PLL_BIT_DIV_Pos                      (0U)
#define LVDS_PMPLLCR2_MST_PLL_BIT_DIV_Msk                      (0x3FFUL << LVDS_PMPLLCR2_MST_PLL_BIT_DIV_Pos)                    /*!< 0x000003FF */
#define LVDS_PMPLLCR2_MST_PLL_BIT_DIV                          LVDS_PMPLLCR2_MST_PLL_BIT_DIV_Msk                                /*!< PLL Output Clock Divider (BDIV, divides output VCO) */
#define LVDS_PMPLLCR2_MST_PLL_BIT_DIV_0                        (0x1UL << LVDS_PMPLLCR2_MST_PLL_BIT_DIV_Pos)                      /*!< 0x00000001 */
#define LVDS_PMPLLCR2_MST_PLL_BIT_DIV_1                        (0x2UL << LVDS_PMPLLCR2_MST_PLL_BIT_DIV_Pos)                      /*!< 0x00000002 */
#define LVDS_PMPLLCR2_MST_PLL_BIT_DIV_2                        (0x4UL << LVDS_PMPLLCR2_MST_PLL_BIT_DIV_Pos)                      /*!< 0x00000004 */
#define LVDS_PMPLLCR2_MST_PLL_BIT_DIV_3                        (0x8UL << LVDS_PMPLLCR2_MST_PLL_BIT_DIV_Pos)                      /*!< 0x00000008 */
#define LVDS_PMPLLCR2_MST_PLL_BIT_DIV_4                        (0x10UL << LVDS_PMPLLCR2_MST_PLL_BIT_DIV_Pos)                     /*!< 0x00000010 */
#define LVDS_PMPLLCR2_MST_PLL_BIT_DIV_5                        (0x20UL << LVDS_PMPLLCR2_MST_PLL_BIT_DIV_Pos)                     /*!< 0x00000020 */
#define LVDS_PMPLLCR2_MST_PLL_BIT_DIV_6                        (0x40UL << LVDS_PMPLLCR2_MST_PLL_BIT_DIV_Pos)                     /*!< 0x00000040 */
#define LVDS_PMPLLCR2_MST_PLL_BIT_DIV_7                        (0x80UL << LVDS_PMPLLCR2_MST_PLL_BIT_DIV_Pos)                     /*!< 0x00000080 */
#define LVDS_PMPLLCR2_MST_PLL_BIT_DIV_8                        (0x100UL << LVDS_PMPLLCR2_MST_PLL_BIT_DIV_Pos)                    /*!< 0x00000100 */
#define LVDS_PMPLLCR2_MST_PLL_BIT_DIV_9                        (0x200UL << LVDS_PMPLLCR2_MST_PLL_BIT_DIV_Pos)                    /*!< 0x00000200 */
#define LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_Pos                    (16U)
#define LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_Msk                    (0x3FFUL << LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_Pos)                  /*!< 0x03FF0000 */
#define LVDS_PMPLLCR2_MST_PLL_INPUT_DIV                        LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_Msk                              /*!< PLL Input Clock Divider (NDIV, divides input reference clock) */
#define LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_0                      (0x1UL << LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_Pos)                /*!< 0x00010000 */
#define LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_1                      (0x2UL << LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_Pos)                /*!< 0x00020000 */
#define LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_2                      (0x4UL << LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_Pos)                /*!< 0x00040000 */
#define LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_3                      (0x8UL << LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_Pos)                /*!< 0x00080000 */
#define LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_4                      (0x10UL << LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_Pos)               /*!< 0x00100000 */
#define LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_5                      (0x20UL << LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_Pos)               /*!< 0x00200000 */
#define LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_6                      (0x40UL << LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_Pos)               /*!< 0x00400000 */
#define LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_7                      (0x80UL << LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_Pos)               /*!< 0x00800000 */
#define LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_8                      (0x100UL << LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_Pos)              /*!< 0x01000000 */
#define LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_9                      (0x200UL << LVDS_PMPLLCR2_MST_PLL_INPUT_DIV_Pos)              /*!< 0x02000000 */

/*****************  Bit definition for LVDS_PMPLLSR register  *****************/
#define LVDS_PMPLLSR_MST_PLL_LOCK_Pos                          (0U)
#define LVDS_PMPLLSR_MST_PLL_LOCK_Msk                          (0x1UL << LVDS_PMPLLSR_MST_PLL_LOCK_Pos)                          /*!< 0x00000001 */
#define LVDS_PMPLLSR_MST_PLL_LOCK                              LVDS_PMPLLSR_MST_PLL_LOCK_Msk                                    /*!< PLL lock During a certain number of cycles of reference clock, pll_lock is asserted high and then goes low waiting for the LVDS-PHY PLL t0 lock */
#define LVDS_PMPLLSR_MST_PLL_REF_OK_Pos                        (4U)
#define LVDS_PMPLLSR_MST_PLL_REF_OK_Msk                        (0x1UL << LVDS_PMPLLSR_MST_PLL_REF_OK_Pos)                        /*!< 0x00000010 */
#define LVDS_PMPLLSR_MST_PLL_REF_OK                            LVDS_PMPLLSR_MST_PLL_REF_OK_Msk                                  /*!< PLL reference ok */
#define LVDS_PMPLLSR_MST_PLL_LDO_OK_Pos                        (8U)
#define LVDS_PMPLLSR_MST_PLL_LDO_OK_Msk                        (0x1UL << LVDS_PMPLLSR_MST_PLL_LDO_OK_Pos)                        /*!< 0x00000100 */
#define LVDS_PMPLLSR_MST_PLL_LDO_OK                            LVDS_PMPLLSR_MST_PLL_LDO_OK_Msk                                  /*!< PLL LDO ok */

/***************  Bit definition for LVDS_PMPLLSDCR1 register  ****************/
#define LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_Pos               (0U)
#define LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_Msk               (0x3FFUL << LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_Pos)             /*!< 0x000003FF */
#define LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO                   LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_Msk                         /*!< Integer Setting of PLL Feedback Clock Divider (MDIV, divides VCO clock for feedback). */
#define LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_0                 (0x1UL << LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_Pos)               /*!< 0x00000001 */
#define LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_1                 (0x2UL << LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_Pos)               /*!< 0x00000002 */
#define LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_2                 (0x4UL << LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_Pos)               /*!< 0x00000004 */
#define LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_3                 (0x8UL << LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_Pos)               /*!< 0x00000008 */
#define LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_4                 (0x10UL << LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_Pos)              /*!< 0x00000010 */
#define LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_5                 (0x20UL << LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_Pos)              /*!< 0x00000020 */
#define LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_6                 (0x40UL << LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_Pos)              /*!< 0x00000040 */
#define LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_7                 (0x80UL << LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_Pos)              /*!< 0x00000080 */
#define LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_8                 (0x100UL << LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_Pos)             /*!< 0x00000100 */
#define LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_9                 (0x200UL << LVDS_PMPLLSDCR1_MST_PLL_SD_INT_RATIO_Pos)             /*!< 0x00000200 */

/***************  Bit definition for LVDS_PMPLLSDCR2 register  ****************/
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos       (0U)
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Msk       (0x7FFFFFUL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)  /*!< 0x007FFFFF */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS           LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Msk                 /*!< Fractional Setting of PLL Feedback Clock Divider (MDIV, divides VCO clock for feedback) */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_0         (0x1UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)       /*!< 0x00000001 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_1         (0x2UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)       /*!< 0x00000002 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_2         (0x4UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)       /*!< 0x00000004 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_3         (0x8UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)       /*!< 0x00000008 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_4         (0x10UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)      /*!< 0x00000010 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_5         (0x20UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)      /*!< 0x00000020 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_6         (0x40UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)      /*!< 0x00000040 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_7         (0x80UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)      /*!< 0x00000080 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_8         (0x100UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)     /*!< 0x00000100 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_9         (0x200UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)     /*!< 0x00000200 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_10        (0x400UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)     /*!< 0x00000400 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_11        (0x800UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)     /*!< 0x00000800 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_12        (0x1000UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)    /*!< 0x00001000 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_13        (0x2000UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)    /*!< 0x00002000 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_14        (0x4000UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)    /*!< 0x00004000 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_15        (0x8000UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)    /*!< 0x00008000 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_16        (0x10000UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)   /*!< 0x00010000 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_17        (0x20000UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)   /*!< 0x00020000 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_18        (0x40000UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)   /*!< 0x00040000 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_19        (0x80000UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)   /*!< 0x00080000 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_20        (0x100000UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)  /*!< 0x00100000 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_21        (0x200000UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)  /*!< 0x00200000 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_22        (0x400000UL << LVDS_PMPLLSDCR2_MST_PLL_SD_INPUT_CODE_BYPASS_Pos)  /*!< 0x00400000 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_BYPASS_VCO_MUX_Pos          (24U)
#define LVDS_PMPLLSDCR2_MST_PLL_SD_BYPASS_VCO_MUX_Msk          (0x3UL << LVDS_PMPLLSDCR2_MST_PLL_SD_BYPASS_VCO_MUX_Pos)          /*!< 0x03000000 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_BYPASS_VCO_MUX              LVDS_PMPLLSDCR2_MST_PLL_SD_BYPASS_VCO_MUX_Msk                    /*!< Bypass control for the PLL sigma delta VCO mux */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_BYPASS_VCO_MUX_0            (0x1UL << LVDS_PMPLLSDCR2_MST_PLL_SD_BYPASS_VCO_MUX_Pos)    /*!< 0x01000000 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_BYPASS_VCO_MUX_1            (0x2UL << LVDS_PMPLLSDCR2_MST_PLL_SD_BYPASS_VCO_MUX_Pos)    /*!< 0x02000000 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_BYPASS_FB_CLK_Pos           (26U)
#define LVDS_PMPLLSDCR2_MST_PLL_SD_BYPASS_FB_CLK_Msk           (0x1UL << LVDS_PMPLLSDCR2_MST_PLL_SD_BYPASS_FB_CLK_Pos)           /*!< 0x04000000 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_BYPASS_FB_CLK               LVDS_PMPLLSDCR2_MST_PLL_SD_BYPASS_FB_CLK_Msk                     /*!< Bypass start SD feedback clock. */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_CLK_EDGE_CNTRL_Pos          (28U)
#define LVDS_PMPLLSDCR2_MST_PLL_SD_CLK_EDGE_CNTRL_Msk          (0x1UL << LVDS_PMPLLSDCR2_MST_PLL_SD_CLK_EDGE_CNTRL_Pos)          /*!< 0x10000000 */
#define LVDS_PMPLLSDCR2_MST_PLL_SD_CLK_EDGE_CNTRL              LVDS_PMPLLSDCR2_MST_PLL_SD_CLK_EDGE_CNTRL_Msk                    /*!< Sigma Delta Edge Control. */

