STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255fxx_ca35.h
/*******************  Bits definition for IAC_ICR5 register *******************/
#define IAC_ICR5_IAF160_Pos           (0U)
#define IAC_ICR5_IAF160_Msk           (0x1UL << IAC_ICR5_IAF160_Pos)             /*!< 0x00000001 */
#define IAC_ICR5_IAF160               IAC_ICR5_IAF160_Msk
#define IAC_ICR5_IAF161_Pos           (1U)
#define IAC_ICR5_IAF161_Msk           (0x1UL << IAC_ICR5_IAF161_Pos)             /*!< 0x00000002 */
#define IAC_ICR5_IAF161               IAC_ICR5_IAF161_Msk
#define IAC_ICR5_IAF162_Pos           (2U)
#define IAC_ICR5_IAF162_Msk           (0x1UL << IAC_ICR5_IAF162_Pos)             /*!< 0x00000004 */
#define IAC_ICR5_IAF162               IAC_ICR5_IAF162_Msk
#define IAC_ICR5_IAF163_Pos           (3U)
#define IAC_ICR5_IAF163_Msk           (0x1UL << IAC_ICR5_IAF163_Pos)             /*!< 0x00000008 */
#define IAC_ICR5_IAF163               IAC_ICR5_IAF163_Msk
#define IAC_ICR5_IAF164_Pos           (4U)
#define IAC_ICR5_IAF164_Msk           (0x1UL << IAC_ICR5_IAF164_Pos)             /*!< 0x00000010 */
#define IAC_ICR5_IAF164               IAC_ICR5_IAF164_Msk
#define IAC_ICR5_IAF165_Pos           (5U)
#define IAC_ICR5_IAF165_Msk           (0x1UL << IAC_ICR5_IAF165_Pos)             /*!< 0x00000020 */
#define IAC_ICR5_IAF165               IAC_ICR5_IAF165_Msk
#define IAC_ICR5_IAF166_Pos           (6U)
#define IAC_ICR5_IAF166_Msk           (0x1UL << IAC_ICR5_IAF166_Pos)             /*!< 0x00000040 */
#define IAC_ICR5_IAF166               IAC_ICR5_IAF166_Msk
#define IAC_ICR5_IAF167_Pos           (7U)
#define IAC_ICR5_IAF167_Msk           (0x1UL << IAC_ICR5_IAF167_Pos)             /*!< 0x00000080 */
#define IAC_ICR5_IAF167               IAC_ICR5_IAF167_Msk
#define IAC_ICR5_IAF168_Pos           (8U)
#define IAC_ICR5_IAF168_Msk           (0x1UL << IAC_ICR5_IAF168_Pos)             /*!< 0x00000100 */
#define IAC_ICR5_IAF168               IAC_ICR5_IAF168_Msk
#define IAC_ICR5_IAF169_Pos           (9U)
#define IAC_ICR5_IAF169_Msk           (0x1UL << IAC_ICR5_IAF169_Pos)             /*!< 0x00000200 */
#define IAC_ICR5_IAF169               IAC_ICR5_IAF169_Msk
#define IAC_ICR5_IAF170_Pos           (10U)
#define IAC_ICR5_IAF170_Msk           (0x1UL << IAC_ICR5_IAF170_Pos)             /*!< 0x00000400 */
#define IAC_ICR5_IAF170               IAC_ICR5_IAF170_Msk
#define IAC_ICR5_IAF171_Pos           (11U)
#define IAC_ICR5_IAF171_Msk           (0x1UL << IAC_ICR5_IAF171_Pos)             /*!< 0x00000800 */
#define IAC_ICR5_IAF171               IAC_ICR5_IAF171_Msk
#define IAC_ICR5_IAF172_Pos           (12U)
#define IAC_ICR5_IAF172_Msk           (0x1UL << IAC_ICR5_IAF172_Pos)             /*!< 0x00001000 */
#define IAC_ICR5_IAF172               IAC_ICR5_IAF172_Msk
#define IAC_ICR5_IAF173_Pos           (13U)
#define IAC_ICR5_IAF173_Msk           (0x1UL << IAC_ICR5_IAF173_Pos)             /*!< 0x00002000 */
#define IAC_ICR5_IAF173               IAC_ICR5_IAF173_Msk
#define IAC_ICR5_IAF174_Pos           (14U)
#define IAC_ICR5_IAF174_Msk           (0x1UL << IAC_ICR5_IAF174_Pos)             /*!< 0x00004000 */
#define IAC_ICR5_IAF174               IAC_ICR5_IAF174_Msk
#define IAC_ICR5_IAF175_Pos           (15U)
#define IAC_ICR5_IAF175_Msk           (0x1UL << IAC_ICR5_IAF175_Pos)             /*!< 0x00008000 */
#define IAC_ICR5_IAF175               IAC_ICR5_IAF175_Msk
#define IAC_ICR5_IAF176_Pos           (16U)
#define IAC_ICR5_IAF176_Msk           (0x1UL << IAC_ICR5_IAF176_Pos)             /*!< 0x00010000 */
#define IAC_ICR5_IAF176               IAC_ICR5_IAF176_Msk
#define IAC_ICR5_IAF177_Pos           (17U)
#define IAC_ICR5_IAF177_Msk           (0x1UL << IAC_ICR5_IAF177_Pos)             /*!< 0x00020000 */
#define IAC_ICR5_IAF177               IAC_ICR5_IAF177_Msk
#define IAC_ICR5_IAF178_Pos           (18U)
#define IAC_ICR5_IAF178_Msk           (0x1UL << IAC_ICR5_IAF178_Pos)             /*!< 0x00040000 */
#define IAC_ICR5_IAF178               IAC_ICR5_IAF178_Msk
#define IAC_ICR5_IAF179_Pos           (19U)
#define IAC_ICR5_IAF179_Msk           (0x1UL << IAC_ICR5_IAF179_Pos)             /*!< 0x00080000 */
#define IAC_ICR5_IAF179               IAC_ICR5_IAF179_Msk
#define IAC_ICR5_IAF180_Pos           (20U)
#define IAC_ICR5_IAF180_Msk           (0x1UL << IAC_ICR5_IAF180_Pos)             /*!< 0x00100000 */
#define IAC_ICR5_IAF180               IAC_ICR5_IAF180_Msk
#define IAC_ICR5_IAF181_Pos           (21U)
#define IAC_ICR5_IAF181_Msk           (0x1UL << IAC_ICR5_IAF181_Pos)             /*!< 0x00200000 */
#define IAC_ICR5_IAF181               IAC_ICR5_IAF181_Msk
#define IAC_ICR5_IAF182_Pos           (22U)
#define IAC_ICR5_IAF182_Msk           (0x1UL << IAC_ICR5_IAF182_Pos)             /*!< 0x00400000 */
#define IAC_ICR5_IAF182               IAC_ICR5_IAF182_Msk
#define IAC_ICR5_IAF183_Pos           (23U)
#define IAC_ICR5_IAF183_Msk           (0x1UL << IAC_ICR5_IAF183_Pos)             /*!< 0x00800000 */
#define IAC_ICR5_IAF183               IAC_ICR5_IAF183_Msk
#define IAC_ICR5_IAF184_Pos           (24U)
#define IAC_ICR5_IAF184_Msk           (0x1UL << IAC_ICR5_IAF184_Pos)             /*!< 0x01000000 */
#define IAC_ICR5_IAF184               IAC_ICR5_IAF184_Msk
#define IAC_ICR5_IAF185_Pos           (25U)
#define IAC_ICR5_IAF185_Msk           (0x1UL << IAC_ICR5_IAF185_Pos)             /*!< 0x02000000 */
#define IAC_ICR5_IAF185               IAC_ICR5_IAF185_Msk
#define IAC_ICR5_IAF186_Pos           (26U)
#define IAC_ICR5_IAF186_Msk           (0x1UL << IAC_ICR5_IAF186_Pos)             /*!< 0x04000000 */
#define IAC_ICR5_IAF186               IAC_ICR5_IAF186_Msk
#define IAC_ICR5_IAF187_Pos           (27U)
#define IAC_ICR5_IAF187_Msk           (0x1UL << IAC_ICR5_IAF187_Pos)             /*!< 0x08000000 */
#define IAC_ICR5_IAF187               IAC_ICR5_IAF187_Msk
#define IAC_ICR5_IAF188_Pos           (28U)
#define IAC_ICR5_IAF188_Msk           (0x1UL << IAC_ICR5_IAF188_Pos)             /*!< 0x10000000 */
#define IAC_ICR5_IAF188               IAC_ICR5_IAF188_Msk
#define IAC_ICR5_IAF189_Pos           (29U)
#define IAC_ICR5_IAF189_Msk           (0x1UL << IAC_ICR5_IAF189_Pos)             /*!< 0x20000000 */
#define IAC_ICR5_IAF189               IAC_ICR5_IAF189_Msk
#define IAC_ICR5_IAF190_Pos           (30U)
#define IAC_ICR5_IAF190_Msk           (0x1UL << IAC_ICR5_IAF190_Pos)             /*!< 0x40000000 */
#define IAC_ICR5_IAF190               IAC_ICR5_IAF190_Msk
#define IAC_ICR5_IAF191_Pos           (31U)
#define IAC_ICR5_IAF191_Msk           (0x1UL << IAC_ICR5_IAF191_Pos)             /*!< 0x80000000 */
#define IAC_ICR5_IAF191               IAC_ICR5_IAF191_Msk

/*******************  Bits definition for IAC_VERR register *******************/
#define IAC_VERR_MINREV_Pos           (0U)
#define IAC_VERR_MINREV_Msk           (0xFUL << IAC_VERR_MINREV_Pos)             /*!< 0x0000000F */
#define IAC_VERR_MINREV               IAC_VERR_MINREV_Msk

